app/views/blogs/_form.html.erb


			<%= f.select :member_id, Member.all.collect {|m| [m.username, m.id]} %>
---
SELECT `members`.* FROM `members`