app/views/blogs/index.html.erb

        <td><%= m.username %></td>
        <td><%= m.blogs.first.subject %>
---
SELECT `blogs`.* FROM `blogs` INNER JOIN `members` ON `members`.`id` = `blogs`.`member_id`