app/controllers/blogs_controller.rb

  def index
#   @blogssss = Blog.all

	@blogs = Member.joins(:blogs)
---
SELECT `blogs`.* FROM `blogs` INNER JOIN `members` ON `members`.`id` = `blogs`.`member_id` WHERE `blogs`.`member_id` = 18 ORDER BY `blogs`.`id` ASC LIMIT 1
SELECT username, subject, content FROM `members` INNER JOIN `blogs` ON `blogs`.`member_id` = `members`.`id` ORDER BY `members`.`id` ASC LIMIT 1

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`content`, `created_at`, `member_id`, `subject`, `updated_at`) VALUES ('', '2014-03-20 07:09:21', 18, '', '2014-03-20 07:09:21')

  def update
    respond_to do |format|




      if @blog.update(blog_params)
---
UPDATE `blogs` SET `subject` = 'Alternative careers after Journalism Part CLXVI', `content` = 'Since most journalists are just corporate or political pimps anyway - it is rather difficult to remove the stain from anyone - so when one quits or finds himself or herself cut back, why not become a real pimp?That is at least what one award-winning sportswriter in the USA decided to do after his newspaper cut salaries.\r\nNo really!\r\nWorse still, he did give the girls in his employ a rather bad deal.\r\nThen again, most (most, not all) Indian sportswriters and sports broadcasters are so busy kissing the ground the BCCI walks on, they would probably just be the prostitutes in such a case.', `updated_at` = '2014-03-20 07:10:38' WHERE `blogs`.`id` = 5

  def destroy
    @blog.destroy
---
DELETE FROM `blogs` WHERE `blogs`.`id` = 3

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 5 LIMIT 1