app/controllers/members_controller.rb

SELECT `members`.* FROM `members` ORDER BY first_name desc
---
	def index
		@o_members = Member.all

SELECT `members`.* FROM `members` WHERE `members`.`id` = 0 LIMIT 1
---
    def set_member
      @member = Member.find(params[:id])

SELECT COUNT(*) FROM `members`
SELECT `members`.* FROM `members` ORDER BY first_name asc LIMIT 5 OFFSET 0
---
  def index



	@pagesize = (params[:pagesize]) ? params[:pagesize] : 5
	@pager_number = (params[:pager_number]) ? params[:pager_number] : 1

#    @o_members = Member.all.limit(@limit)
#	@o_members = Member.order(sort_column + " " + sort_direction).limit(@pagesize)
	@o_members = Member.order(sort_column + " " + sort_direction).paginate(:per_page => @pagesize, :page => @pager_number)